// Задача 18: Напишите программу, 
// 1. которая по заданному номеру четверти, показывает диапазон
// возможных координат точек в этой четверти (x и y).

// Console.Write("Введите номер четверти: ");
// string quarter = Console.ReadLine();

// string Quarter(string quarterXY)
// {
//     if(quarterXY == "1") return "x > 0 : y > 0";
//     if(quarterXY == "2") return "x < 0 : y > 0";
//     if(quarterXY == "3") return "x < 0 : y < 0";
//     if(quarterXY == "4") return "x > 0 : y < 0";
//     return "некорректный ввод";
// }

// string res = Quarter (quarter);
// Console.WriteLine(res);



// Тренировка:
// double res = 25.87545;
// double result = Math.Round(res, 2, MidpointRounding.ToZero);
// Console.WriteLine(result);
// double r = Math.Pow(2, 3);
// Console.WriteLine(r);







// Console.Write("Введите номер четверти: ");
// int number = Convert.ToInt32(Console.ReadLine());

// string Quarter(int num)
// {
//     if(num == 1) return "x > 0 & y > 0";
//     if(num == 2) return "x < 0 & y > 0";
//     if(num == 3) return "x < 0 & y < 0";
//     if(num == 4) return "x > 0 & y < 0";
//     return "Введено некорректное число!";
// }

// string quarter = Quarter(number);
// Console.Write(quarter);
// Console.Write(quarter);













// Console.WriteLine("Введите номер четверти:");
// int quater = Convert.ToInt32(Console.ReadLine())
// string Diopos(int quat)
// {
//     if (quat == 1) return "Диапазон значений координат x > 0 и y > 0";
//     if (quat == 2) return "Диапазон значений координат x < 0 и y > 0";
//     if (quat == 3) return "Диапазон значений координат x < 0 и y < 0";
//     if (quat == 4) return "Диапазон значений координат x > 0 и y < 0";
    
// }


// Console.WriteLine("Введите номер четверти: ");
// int quater = Convert.ToInt32(Console.ReadLine());

// string Diopos(int quat)
// {
//     if (quat == 1) return "Диапазон значений коодинат X > 0 и Y > 0";
//     if (quat == 2) return "Диапазон значений коодинат X < 0 и Y > 0";
//     if (quat == 3) return "Диапазон значений коодинат X < 0 и Y < 0";
//     if (quat == 4) return "Диапазон значений коодинат X > 0 и Y < 0";
//     return "Введите значение от 1 до 4";
// }

// string resalt = Diopos(quater);
// Console.WriteLine(resalt);
